# Lining Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Lining Property
GroupTypeId Class See Also
---
Lining.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Lining { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Lining As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Lining {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace